from typing import List
import csv


def load_songs_from_csv(filename: str) -> List[List[str]]:
    with open(filename, newline='', encoding='utf-8') as csvfile:
        reader = csv.reader(csvfile)
        headers = next(reader)  # Пропускаем заголовки
        return [row for row in reader]


SONG_HEADERS: List[str] = ["ID", "Исполнитель", "Название", "Время", "ФИО композитора", "ФИО автора текста", "Лэйбл"]
# SONGS_LIST: List[List[str]] = load_songs_from_csv("/home/blxnk/Documents/work/py/fake_songs.csv")
SONGS_LIST: List[List[str]] = [
    ["1", "Юрий Антонов", "Маки", "5:36", "Антонов Ю.М.", "Поженяни Г.М.", "ООО Фирма Мелодия"],
    ["2", "Алла Пугачёва", "Арлекино", "4:12", "Паулс Р.О.", "Резник И.Ш.", "Мелодия"],
    ["3", "Муслим Магомаев", "Королева красоты", "3:58", "Пахмутова А.Н.", "Дербенёв Л.А.", "Мелодия"],
    ["4", "Владимир Высоцкий", "Песня о друге", "2:45", "Высоцкий В.С.", "Высоцкий В.С.", "Авторская студия"],
    ["5", "Людмила Зыкина", "Течёт река Волга", "4:20", "Фрадкин М.Г.", "Долматовский Е.А.", "Мелодия"],
    ["6", "Игорь Крутой", "Без слов", "3:30", "Крутой И.Я.", "нет", "Крутой Records"],
    ["7", "Дима Билан", "На берегу неба", "3:57", "Кипелов А.В.", "Кипелов А.В.", "Universal Music"],
    ["8", "Земфира", "Искала", "4:01", "Рамазанова З.Т.", "Рамазанова З.Т.", "Sony Music"],
    ["9", "Сергей Лазарев", "В самое сердце", "3:41", "Катаев А.Н.", "Катаев А.Н.", "Sony Music"],
    ["10", "Юта", "Позови меня", "4:15", "Юта (Сергеева А.В.)", "Юта (Сергеева А.В.)", "Real Records"],
    ["11", "Нюша", "Выбирать чудо", "3:50", "Шуров С.И.", "Шуров С.И.", "Первое музыкальное"],
    ["12", "Баста", "Моя игра", "5:10", "Вакуленко В.М.", "Вакуленко В.М.", "Gazgolder"],
    ["13", "Мот", "На дне", "3:48", "Мотовилов М.Г.", "Мотовилов М.Г.", "Black Star"],
    ["14", "Леонид Агутин", "На сиреневой луне", "4:05", "Агутин Л.Н.", "Агутин Л.Н.", "Агутин Music"],
    ["15", "МакSим", "Знаешь ли ты", "4:32", "Абросимова М.С.", "Абросимова М.С.", "Снегири"]
]